version: '3.8'

services:
  backend:
    build:
      context: .
      dockerfile: backend/Dockerfile
    ports:
      - "80:5000"
      - "5000:5000"
    environment:
      - APP_MONGO_URI=mongodb://mongodb:27017/
      - APP_SPLUNK_SERVER_URL=https://splunk.dmz.tfan.me
      - APP_SPLUNK_QUERY_TEMPLATE=index=net-fw 
          | stats count, values(dest_port) as ports by src_ip dest_ip rule date 
          | eval ports=mvjoin(ports,":")
    depends_on:
      - mongodb
    deploy:
      resources:
        limits:
          cpus: '1.0'
          memory: 2048M

  worker:
    build:
      context: .
      dockerfile: worker/Dockerfile
    environment:
      - APP_MONGO_URI=mongodb://mongodb:27017/
      - APP_SPLUNK_SERVER_URL=https://splunk.dmz.tfan.me
      - APP_SPLUNK_QUERY_TEMPLATE=index=net-fw 
          | stats count, values(dest_port) as ports by src_ip dest_ip rule date 
          | eval ports=mvjoin(ports,":")
    depends_on:
      - mongodb
    deploy:
      resources:
        limits:
          cpus: '1.0'
          memory: 2048M

  mongodb:
    image: mongo:latest
    ports:
      - "27017:27017"
    volumes:
      - mongo-data:/data/db


volumes:
  mongo-data:
