version: '3.8'

services:
  backend:
    build: ./backend
    ports:
      - "80:5000"
      - "5000:5000"
    environment:
      - MONGO_URI=mongodb://mongodb:27017/
      - SPLUNK_SERVER_URL=https://splunk.dmz.tfan.me
      - SPLUNK_QUERY_TEMPLATE=index=net-fw | stats count by src_ip dest_ip rule
    depends_on:
      - mongodb

  mongodb:
    image: mongo:latest
    ports:
      - "27017:27017"
    volumes:
      - mongo-data:/data/db

volumes:
  mongo-data:
